# Groupby

The groupby method is used to group rows together and perform aggregate functions

In [2]:
import pandas as pd
# Create dataframe as given below
dat = {'CustID':['1001','1001','1002','1002','1003','1003'],
       'CustName':['UIPat','DatRob','Goog','Chrysler','Ford','GM'],
       'Profitinlakhs':[2005,3245,1245,8765,5463,3547]}

In [4]:
dataframe = pd.DataFrame(dat)

In [5]:
dataframe

  CustID  CustName  Profitinlakhs
0   1001     UIPat           2005
1   1001    DatRob           3245
2   1002      Goog           1245
3   1002  Chrysler           8765
4   1003      Ford           5463
5   1003        GM           3547

** We can now use the .groupby() method to group rows together based on a column name. For example let's group based on CustID. This will create a DataFrameGroupBy object:**

In [7]:
dataframe.groupby('CustID')

This object can be saved as a variable

In [11]:
CustID_grouped = dataframe.groupby("CustID")

Now we can aggregate using the variable

In [9]:
CustID_grouped.mean()

        Profitinlakhs
CustID
1001             2625
1002             5005
1003             4505

#### Or we can call the groupby function for each aggregation

In [12]:
dataframe.groupby('CustID').mean()

        Profitinlakhs
CustID
1001             2625
1002             5005
1003             4505

Some more examples

In [13]:
CustID_grouped.std()

        Profitinlakhs
CustID
1001       876.812409
1002      5317.442995
1003      1354.816593

In [14]:
CustID_grouped.min()

        CustName  Profitinlakhs
CustID
1001      DatRob           2005
1002    Chrysler           1245
1003        Ford           3547

In [15]:
CustID_grouped.max()

       CustName  Profitinlakhs
CustID
1001      UIPat           3245
1002       Goog           8765
1003         GM           5463

In [16]:
CustID_grouped.count()

        CustName  Profitinlakhs
CustID
1001           2              2
1002           2              2
1003           2              2

In [17]:
CustID_grouped.describe()

       Profitinlakhs                                                       \
               count    mean          std     min     25%     50%     75%
CustID
1001             2.0  2625.0   876.812409  2005.0  2315.0  2625.0  2935.0
1002             2.0  5005.0  5317.442995  1245.0  3125.0  5005.0  6885.0
1003             2.0  4505.0  1354.816593  3547.0  4026.0  4505.0  4984.0


           max
CustID
1001    3245.0
1002    8765.0
1003    5463.0

In [18]:
CustID_grouped.describe().transpose()

CustID                      1001         1002         1003
Profitinlakhs count     2.000000     2.000000     2.000000
              mean   2625.000000  5005.000000  4505.000000
              std     876.812409  5317.442995  1354.816593
              min    2005.000000  1245.000000  3547.000000
              25%    2315.000000  3125.000000  4026.000000
              50%    2625.000000  5005.000000  4505.000000
              75%    2935.000000  6885.000000  4984.000000
              max    3245.000000  8765.000000  5463.000000

In [19]:
CustID_grouped.describe().transpose()['1001']

Profitinlakhs  count       2.000000
               mean     2625.000000
               std       876.812409
               min      2005.000000
               25%      2315.000000
               50%      2625.000000
               75%      2935.000000
               max      3245.000000
Name: 1001, dtype: float64

### The END